#+TITLE: 02.Lisp-Data-Types
* 2 Lisp Data Types
   :PROPERTIES:
   :CUSTOM_ID: lisp-data-types
   :END:
   :LOGBOOK:
   CLOCK: [2020-03-14 Sat 09:40]--[2020-03-14 Sat 09:50] =>  0:10
   :END:

A Lisp object is a piece of data used and manipulated by Lisp programs. For our purposes, a type or data type is a set of possible objects.

Every object belongs to at least one type. Objects of the same type have similar structures and may usually be used in the same contexts. Types can overlap, and objects can belong to two or more types. Consequently, we can ask whether an object belongs to a particular type, but not for /the/ type of an object.

A few fundamental object types are built into Emacs. These, from which all other types are constructed, are called primitive types. Each object belongs to one and only one primitive type. These types include integer, float, cons, symbol, string, vector, hash-table, =rsubr=, byte-code function, and record, plus several special types, such as buffer, that are related to editing. (See [[2.4 Editing Types]].)

Each primitive type has a corresponding Lisp function that checks whether an object is a member of that type.

Lisp is unlike many other languages in that its objects are self-typing: the primitive type of each object is implicit in the object itself. For example, if an object is a vector, nothing can treat it as a number; Lisp knows it is a vector, not a number.

In most languages, the programmer must declare the data type of each variable, and the type is known by the compiler but not represented in the data. Such type declarations do not exist in Emacs Lisp. A Lisp variable can have any type of value, and it remembers whatever value you store in it, type and all. (Actually, a small number of Emacs Lisp variables can only take on values of a certain type. (See [[file:12.Variables.org::12.16 Variables with Restricted Values]])

This chapter describes the purpose, printed representation, and read syntax of each of the standard types in GNU Emacs Lisp. Details on how to use these types can be found in later chapters.

1) [[https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Printed-Representation][Printed Representation]]: How Lisp objects are represented as text.
2) [[https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Comments][Comments]]: Comments and their formatting conventions.
3) [[https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Programming-Types][Programming Types]]: Types found in all Lisp systems.
4) [[https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Editing-Types][Editing Types]]: Types specific to Emacs.
5) [[https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Circular-Objects][Circular Objects]]: Read syntax for circular structure.
6) [[https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Type-Predicates][Type Predicates]]: Tests related to types.
7) [[https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Equality-Predicates][Equality Predicates]]: Tests of equality between any two objects.

** 2.3.3 Character Type
     :PROPERTIES:
     :CUSTOM_ID: character-type
     :END:

A character in Emacs Lisp is nothing more than an integer. In other words, characters are represented by their character codes. For example, the character A is represented as the integer 65.
# 洞见: 此处说得好哇, 源于此, integter与character是都是整型, 此处为重要的过度节点.

Individual characters are used occasionally in programs, but it is more common to work with /strings/, which are sequences composed of characters. See [[2.3.8 String Type]].

Characters in strings and buffers are currently limited to the range of 0 to 4194303---twenty two bits (see [[https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Character-Codes][Character Codes]]). Codes 0 through 127 are ASCII codes; the rest are non-ASCII (see [[file:33.Non-ASCII-Characters.org][33 Non-ASCII Characters]]). Characters that represent keyboard input have a much wider range, to encode modifier keys such as Control, Meta and Shift.
#+begin_src ipython :session elisp :results output
import math
print(math.log2(4194303))
#+end_src

#+RESULTS:
: 21.999999656034657

There are special functions for producing a human-readable textual description of a character for the sake of messages. See [[file:24.Documentation.org::24.5 Describing Characters for Help Messages][24.5 Describing Characters for Help Messages]].

1. [[https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Basic-Char-Syntax][Basic Char Syntax]]: Syntax for regular characters.
2. [[https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#General-Escape-Syntax][General Escape Syntax]]: How to specify characters by their codes.
3. [[https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Ctl_002dChar-Syntax][Ctl-Char Syntax]]: Syntax for control characters.
4. [[https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Meta_002dChar-Syntax][Meta-Char Syntax]]: Syntax for meta-characters.
5. [[https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Other-Char-Bits][Other Char Bits]]: Syntax for hyper-, super-, and alt-characters.


*** 2.3.3.1 Basic Char Syntax
      :PROPERTIES:
      :CUSTOM_ID: basic-char-syntax
      :END:

Since characters are really integers, the printed representation of a character is a decimal number. This is also a possible read syntax for a character, but writing characters that way in Lisp programs is not clear programming. You should /always/ use the special read syntax formats that Emacs Lisp provides for characters. These syntax formats start with a question mark.

The usual read syntax for alphanumeric characters is a question mark followed by the character; thus, '?A' for the character A, '?B' for the character B, and '?a' for the character a.

For example:

#+BEGIN_SRC elisp
?Q  # 这种查询方法比较有意思.
#+END_SRC

#+RESULTS:
: 81

#+begin_src ipython :session elisp :results value
chr(81)
#+end_src

#+RESULTS:
: # Out[4]:
: : 'Q'
#+begin_src ipython :session elisp :results value
ord("Q")
#+end_src

#+RESULTS:
: # Out[6]:
: : 81

You can use the same syntax for punctuation characters. However, if the punctuation character has a special syntactic meaning in Lisp, you must quote it with a ''. For example, ‘?(' is the way to write the open-paren character. Likewise, if the character is '', you must use a second ‘' to quote it: ‘?\'.

You can express the characters control-g, backspace, tab, newline, vertical tab, formfeed, space, return, del, and escape as '?\a', '?\b', '?\t', '?\n', '?\v’, ‘?\f', '?\s', '?\r', '?\d', and '?\e', respectively. ('?\s' followed by a dash has a different meaning---it applies the Super modifier to the following character.) Thus,

#+BEGIN_SRC elisp
         ?\a ⇒ 7                 ; control-g, C-g
         ?\b ⇒ 8                 ; backspace, <BS>, C-h
         ?\t ⇒ 9                 ; tab, <TAB>, C-i
         ?\n ⇒ 10                ; newline, C-j
         ?\v ⇒ 11                ; vertical tab, C-k
         ?\f ⇒ 12                ; formfeed character, C-l
         ?\r ⇒ 13                ; carriage return, <RET>, C-m
         ?\e ⇒ 27                ; escape character, <ESC>, C-[
         ?\s ⇒ 32                ; space character, <SPC>
         ?\\ ⇒ 92                ; backslash character, \
         ?\d ⇒ 127               ; delete character, <DEL>
#+END_SRC
# 短评: 直观而且简单.
These sequences which start with backslash are also known as escape sequences, because backslash plays the role of an escape character; this has nothing to do with the character . '\s' is meant for use in character constants; in string constants, just write the space.

A backslash is allowed, and harmless, preceding any character without a special escape meaning; thus, '?+' is equivalent to '?+'. There is no reason to add a backslash before most characters. However, you must add a backslash before any of the characters '()[];"', and you should add a backslash before any of the characters '|'`#.,' to avoid confusing the Emacs commands for editing Lisp code. You can also add a backslash before whitespace characters such as space, tab, newline and formfeed. However, it is cleaner to use one of the easily readable escape sequences, such as '\t' or '\s', instead of an actual whitespace character such as a tab or a space. (If you do write backslash followed by a space, you should write an extra space after the character constant to separate it from the following text.)



*** 2.3.3.2 General Escape Syntax
      :PROPERTIES:
      :CUSTOM_ID: general-escape-syntax
      :END:

In addition to the specific escape sequences for special important control characters, Emacs provides several types of escape syntax that you can use to specify non-ASCII text characters.

1. You can specify characters by their Unicode names, if any. =?\N{=NAME=}= represents the Unicode character named NAME. Thus, '?\N{LATIN SMALL LETTER A WITH GRAVE}' is equivalent to =?à= and denotes the Unicode character U+00E0. To simplify entering multi-line strings, you can replace spaces in the names by non-empty sequences of whitespace (e.g., newlines).
   #+begin_src emacs-lisp :tangle yes
?\N{LATIN SMALL LETTER A WITH GRAVE}
?à
   #+end_src

   #+RESULTS:
   : 224
# 短评: 此处有意思.
2. You can specify characters by their Unicode values. =?\N{U+=X=}= represents a character with Unicode code point X, where X is a hexadecimal number. Also, =?\uxxxx= and =?\Uxxxxxxxx= represent code points xxxx and xxxxxxxx, respectively, where each x is a single hexadecimal digit. For example, =?\N{U+E0}=, =?\u00e0= and =?\U000000E0= are all equivalent to =?à= and to '?\N{LATIN SMALL LETTER A WITH GRAVE}'. The Unicode Standard defines code points only up to 'U+10ffff', so if you specify a code point higher than that, Emacs signals an error.\\
3. You can specify characters by their hexadecimal character codes. A hexadecimal escape sequence consists of a backslash, 'x', and the hexadecimal character code. Thus, '?\x41' is the character A, '?\x1' is the character C-a, and =?\xe0= is the character à (a with grave accent). You can use any number of hex digits, so you can represent any character code in this way.\\
4. You can specify characters by their character code in octal. An octal escape sequence consists of a backslash followed by up to three octal digits; thus, '?\101' for the character A, '?\001' for the character C-a, and =?\002= for the character C-b. Only characters up to octal code 777 can be specified this way.

These escape sequences may also be used in strings. See [[2.3.8.2 Non-ASCII Characters in Strings]].


*** 2.3.8.1 Syntax for Strings
      :PROPERTIES:
      :CUSTOM_ID: syntax-for-strings
      :END:

The read syntax for a string is a double-quote, an arbitrary number of characters, and another double-quote, ="like this"= . To include a double-quote in a string, precede it with a backslash; thus, ="\""= is a string containing just one double-quote character. Likewise, you can include a backslash by preceding it with another backslash, like this: ="this \\ is a single embedded backslash"=.

The newline character is not special in the read syntax for strings; if you write a new line between the double-quotes, it becomes a character in the string. But an escaped newline---one that is preceded by ''---does not become part of the string; i.e., the Lisp reader ignores an escaped newline while reading a string. An escaped space ‘ ' is likewise ignored.

#+BEGIN_SRC elisp
         "It is useful to include newlines
         in documentation strings,
         but the newline is \
         ignored if escaped."
#+END_SRC

#+RESULTS:
: It is useful to include newlines
:          in documentation strings,
:          but the newline is          ignored if escaped.


*** 2.3.8.4 Text Properties in Strings
      :PROPERTIES:
      :CUSTOM_ID: text-properties-in-strings
      :END:

A string can hold properties for the characters it contains, in addition to the characters themselves. This enables programs that copy text between strings and buffers to copy the text's properties with no special effort. See [[file:32.Text.org::32.19 Text Properties][32.19 Text Properties]], for an explanation of what text properties mean. Strings with text properties use a special read and print syntax:

#+BEGIN_SRC elisp
#("characters" property-data...)
#+END_SRC

where property-data consists of zero or more elements, in groups of three as follows:

#+BEGIN_SRC elisp
beg end plist
#+END_SRC

The elements beg and end are integers, and together specify a range of indices in the string; plist is the property list for that range. For example,

#+BEGIN_SRC elisp
#("foo bar" 0 3 (face bold) 3 4 nil 4 7 (face italic))
#+END_SRC

#+RESULTS:
: foo bar
# 得到:

represents a string whose textual contents are 'foo bar', in which the first three characters have a =face= property with value =bold=, and the last three have a =face= property with value =italic=. (The fourth character has no text properties, so its property list is =nil=. It is not actually necessary to mention ranges with =nil= as the property list, since any characters not mentioned in any range will default to having no properties.)

** 2.3.9 Vector Type
     :PROPERTIES:
     :CUSTOM_ID: vector-type
     :END:

A vector is a one-dimensional array of elements of any type. It takes a constant amount of time to access any element of a vector. (In a list, the access time of an element is proportional to the distance of the element from the beginning of the list.)

The printed representation of a vector consists of a left square bracket, the elements, and a right square bracket. This is also the read syntax. Like numbers and strings, vectors are considered constants for evaluation.

#+BEGIN_SRC elisp
         [1 "two" (three)]      ; A vector of three elements.
              ⇒ [1 "two" (three)]
#+END_SRC

#+begin_src emacs-lisp :tangle yes
[1 "two" (three)]
#+end_src

#+RESULTS:
: [1 "two" (three)]

See [[file:06.Sequences-Arrays-and-Vectors.org::6.4 Vectors][6.4 Vectors]], for functions that work with vectors.

** 2.3.12 Hash Table Type
     :PROPERTIES:
     :CUSTOM_ID: hash-table-type
     :END:

A hash table is a very fast kind of lookup table, somewhat like an alist in that it maps keys to corresponding values, but much faster. The printed representation of a hash table specifies its properties and contents, like this:

#+BEGIN_SRC elisp
         (make-hash-table)
              ⇒ #s(hash-table size 65 test eql rehash-size 1.5
                                      rehash-threshold 0.8125 data ())
#+END_SRC

#+begin_src emacs-lisp :tangle yes
(make-hash-table)
#+end_src

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data ())

See [[file:08.Hash-Tables.org][08.Hash-Table]], for more information about hash tables.

** 2.4.1 Buffer Type
     :PROPERTIES:
     :CUSTOM_ID: buffer-type
     :END:

A buffer is an object that holds text that can be edited (see [[file:27.Buffer.org][27.Buffers]]). Most buffers hold the contents of a disk file (see [[file:25.Files.org][25.Files]]) so they can be edited, but some are used for other purposes. Most buffers are also meant to be seen by the user, and therefore displayed, at some time, in a window (see [[file:28.Windows.org][28.Windows]]). But a buffer need not be displayed in any window. Each buffer has a designated position called point (see [[file:30.Position.org][30.Positions]]); most editing commands act on the contents of the current buffer in the neighborhood of point. At any time, one buffer is the current buffer.

The contents of a buffer are much like a string,
# 洞见: 学python第一天, 教程里就开宗明义阐明这一点该有多好呢.
but buffers are not used like strings in Emacs Lisp, and the available operations are different. For example, you can insert text efficiently into an existing buffer, altering the buffer's contents, whereas inserting text into a string requires concatenating substrings, and the result is an entirely new string object.
# 洞见: 此处的解说实在是愚笨得可爱.

Many of the standard Emacs functions manipulate or test the characters in the current buffer; a whole chapter in this manual is devoted to describing these functions (see [[file:32.Text.org][32.Text]]).

Several other data structures are associated with each buffer:

1) a local syntax [[file:35.Syntax-Tables.org][35.Syntax-Tables]]);\\
2) a local keymap (see [[file:22.Keymaps.org][22.Keymaps]]); and,\\
3) a list of buffer-local variable bindings (see [[file:12.Variables.org][12.11.Buffer-Local Variables]]).\\
4) overlays (see [[file:39.Emacs-Display.org][39.9.Overlays]]).\\
5) text properties for the text in the buffer (see [[file:32.Text.org][32.19.Text Properties]]).

The local keymap and variable list contain entries that individually override global bindings or values. These are used to customize the behavior of programs in different buffers, without actually changing the programs.

A buffer may be indirect, which means it shares the text of another buffer, but presents it differently. See [[file:27.Buffer.org::27.11 Indirect Buffers][27.11 Indirect Buffers]].

Buffers have no read syntax. They print in hash notation, showing the buffer name.

#+BEGIN_SRC elisp
(current-buffer)
#+END_SRC

#+RESULTS:
: #<buffer 02.Lisp-Data-Types.org>

** 2.4.2 Marker Type
     :PROPERTIES:
     :CUSTOM_ID: marker-type
     :END:

A marker denotes a position in a specific buffer. Markers therefore have two components: one for the buffer, and one for the position. Changes in the buffer's text automatically relocate the position value as necessary to ensure that the marker always points between the same two characters in the buffer.

Markers have no read syntax. They print in hash notation, giving the current character position and the name of the buffer.

#+BEGIN_SRC elisp
(point-marker)
#+END_SRC

#+RESULTS:
: #<marker at 66341 in 02.Lisp-Data-Types.org>
# 得到: marker是两点, 意料之中, 也是意料之外.

See [[file:31.Marker.org][31.Marker]], for information on how to test, create, copy, and move markers.

** 2.4.3 Window Type
     :PROPERTIES:
     :CUSTOM_ID: window-type
     :END:

A window describes the portion of the terminal screen that Emacs uses to display a buffer. Every window has one associated buffer, whose contents appear in the window. By contrast, a given buffer may appear in one window, no window, or several windows.

Though many windows may exist simultaneously, at any time one window is designated the selected window. This is the window where the cursor is (usually) displayed when Emacs is ready for a command. The selected window usually displays the current buffer (see [[file:27.Buffer.org::27.2 The Current Buffer][27.2 The Current Buffer]]), but this is not necessarily the case.

Windows are grouped on the screen into frames; each window belongs to one and only one frame. See [[2.4.4 Frame Type]].

Windows have no read syntax. They print in hash notation, giving the window number and the name of the buffer being displayed. The window numbers exist to identify windows uniquely, since the buffer displayed in any given window can change frequently.

#+BEGIN_SRC elisp
(selected-window)
#+END_SRC

#+RESULTS:
: #<window 112 on 02.Lisp-Data-Types.org>

See [[file:28.Windows.org][28.Windows]], for a description of the functions that work on windows.

** 2.4.4 Frame Type
     :PROPERTIES:
     :CUSTOM_ID: frame-type
     :END:

A frame is a screen area that contains one or more Emacs windows; we also use the term "frame" to refer to the Lisp object that Emacs uses to refer to the screen area.

Frames have no read syntax. They print in hash notation, giving the frame's title, plus its address in core (useful to identify the frame uniquely).

#+BEGIN_SRC elisp
(selected-frame)
#+END_SRC

#+RESULTS:
: #<frame 02.Lisp-Data-Types.org – Doom Emacs 0x11b9c30>

See [[file:29.Frame.org][29.Frames]], for a description of the functions that work on frames.

** 2.4.5 Terminal Type
     :PROPERTIES:
     :CUSTOM_ID: terminal-type
     :END:

A terminal is a device capable of displaying one or more Emacs frames (see [[https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Frame-Type][Frame Type]]).

Terminals have no read syntax. They print in hash notation giving the terminal's ordinal number and its TTY device file name.

#+BEGIN_SRC elisp
(get-device-terminal nil)
#+END_SRC

#+RESULTS:
: #<terminal 1 on :0>

** 2.4.8 Process Type
     :PROPERTIES:
     :CUSTOM_ID: process-type
     :END:

The word process usually means a running program. Emacs itself runs in a process of this sort. However, in Emacs Lisp, a process is a Lisp object that designates a subprocess created by the Emacs process. Programs such as shells, GDB, ftp, and compilers, running in subprocesses of Emacs, extend the capabilities of Emacs. An Emacs subprocess takes textual input from Emacs and returns textual output to Emacs for further manipulation. Emacs can also send signals to the subprocess.

Process objects have no read syntax. They print in hash notation, giving the name of the process:

#+BEGIN_SRC elisp
(process-list)
#+END_SRC

#+RESULTS:
| fanyi.youdao.com | server |

See [[file:38.Processes.org][38.Processes]],for information about functions that create, delete, return information about, send input or signals to, and receive output from processes.

** 2.4.9 Thread Type
     :PROPERTIES:
     :CUSTOM_ID: thread-type
     :END:

A thread in Emacs represents a separate thread of Emacs Lisp execution. It runs its own Lisp program, has its own current buffer, and can have subprocesses locked to it, i.e. subprocesses whose output only this thread can accept. [[file:37.Thread.org][37.Threads]].

Thread objects have no read syntax. They print in hash notation, giving the name of the thread (if it has been given a name) or its address in core:

#+BEGIN_SRC elisp
(all-threads)
#+END_SRC

#+RESULTS:
| #<thread 0x9fe8e0> |

** 2.4.11 Condition Variable Type
     :PROPERTIES:
     :CUSTOM_ID: condition-variable-type
     :END:

A condition variable is a device for a more complex thread synchronization than the one supported by a mutex. A thread can wait on a condition variable, to be woken up when some other thread notifies the condition.

Condition variable objects have no read syntax. They print in hash notation, giving the name of the condition variable (if it has been given a name) or its address in core:

#+BEGIN_SRC elisp
(make-condition-variable (make-mutex))
#+END_SRC

#+RESULTS:
: #<condvar 0x77bee60>

